-- Лікарі (Doctors)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор 
-- лікаря.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Ім’я (Name). Ім’я лікаря.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожнє.
-- ■ Надбавка (Premium). Надбавка лікаря.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.
-- ■ Ставка (Salary). Ставка лікаря.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути меншою або дорівнювати 0.
-- ■ Прізвище (Surname). Прізвище лікаря.
-- ▷ Тип даних — varchar(max).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.



SELECT *
FROM DOCTORS

-- ДОБАВИТИ СТОВПЧИК ДО ІСНУЮЧОЇ ТАБЛИЦІ

-- ■ Надбавка (Premium). Надбавка лікаря.
-- ▷ Тип даних для зберігання грошових значень.
-- ▷ Не містить null-значення.
-- ▷ Не може бути менше, ніж 0.
-- ▷ Значення за замовчуванням — 0.

ALTER TABLE DOCTORS
ADD COLUMN PREMIUM FLOAT NOT NULL CHECK(PREMIUM >= 0) DEFAULT 0

-- ЗАПОВНЕННЯ СТОВПЧИКА 
UPDATE DOCTORS
SET PREMIUM = ROUND(500*RANDOM())

-- 10% ВІД ЗАРПЛАТИ
UPDATE DOCTORS
SET PREMIUM = 0.1*SALARY


-- Спеціалізації (Specializations)
-- ■ Ідентифікатор (Id). Унікальний ідентифікатор 
-- спеці-алізації.
-- ▷ Тип даних — int.
-- ▷ Автоприріст.
-- ▷ Не містить null-значення.
-- ▷ Первинний ключ.
-- ■ Назва (Name). Назва спеціалізації.
-- ▷ Тип даних — varchar(100).
-- ▷ Не містить null-значення.
-- ▷ Не може бути порожньою.
-- ▷ Має бути унікальною.

CREATE TABLE SPECIALIZATIONS(
	ID SERIAL NOT NULL PRIMARY KEY,
	NAME VARCHAR(100) NOT NULL CHECK(NAME != '') UNIQUE
)


INSERT INTO SPECIALIZATIONS (NAME) VALUES
('Кардіолог'),
('Хірург'),
('Терапевт'),
('Невролог'),
('Дерматолог'),
('Офтальмолог'),
('Педіатр'),
('Онколог'),
('Стоматолог'),
('Психіатр');

SELECT *
FROM SPECIALIZATIONS

-- Лікарі та спеціалізації (DoctorsSpecializations)
-- ■ Ідентифікатор лікаря (DoctorId). Лікар.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ.
-- ■ Ідентифікатор спеціалізації (SpecializationId). Спеціалізація.
-- ▷ Тип даних — int.
-- ▷ Не містить null-значення.
-- ▷ Зовнішній ключ



CREATE TABLE DOCTORSSPECIALIZATIONS(
	DOCTORID INT NOT NULL REFERENCES DOCTORS(ID),
	SPECIALIZATIONID INT NOT NULL REFERENCES SPECIALIZATIONS(ID),
	PRIMARY KEY(DOCTORID, SPECIALIZATIONID)
)

INSERT INTO DOCTORSSPECIALIZATIONS (DOCTORID, SPECIALIZATIONID) VALUES
(1, 1),
(1, 2),
(2, 3),
(3, 4),
(4, 5),
(5, 6),
(6, 7),
(7, 8),
(8, 9),
(9, 10),
(10, 1),
(11, 2),
(12, 3),
(13, 4),
(14, 5),
(15, 6),
(16, 7),
(17, 8),
(18, 9),
(19, 10),
(20, 1),
(21, 2),
(22, 3),
(23, 4),
(24, 5),
(25, 6),
(26, 7),
(27, 8),
(28, 9),
(29, 10),
(30, 1),
(31, 2),
(32, 3),
(33, 4),
(34, 5),
(35, 6),
(36, 7),
(37, 8),
(38, 9),
(39, 10),
(40, 1);

